app/Controllers/Carrito_Controller.php

SELECT *
FROM `ventas`
---
    public function misVentas(){


        $ventasModel = new Ventas_Model();
        $ventas = array('ventas' => $ventasModel->findAll());