app/Controllers/Productos_Controllers.php

    public function panelProductos (){
        $data ['titulo']='Vegetarian :: Panel Productos';
        echo view('head', $data);

        $productos = new Productos_model();
        $datos['productos'] = $productos -> orderBy ('id', 'ASC') ->findAll();
---
SELECT *
FROM `productos`
ORDER BY `id` ASC

    public function editar ($id = null){
        $data['titulo']='Vegetarian :: Editar Usuario';
        echo view('head',$data);

        $productos = new Productos_model();
        $datos['productos']=$productos->where('id',$id)->first();
---
SELECT *
FROM `productos`
WHERE `id` = '53'
 LIMIT 1

    public function mostrarProductos (){

        $productos = new Productos_model();
        $galeria = new Galeria_model();

        $data2 ['galeria'] = $galeria -> orderBy ('id','ASC')-> findAll();
        $datos['productos'] = $productos -> orderBy ('id', 'ASC') ->findAll();
---
SELECT *
FROM `productos`
ORDER BY `id` ASC